# PDF_DestroyBlob

## Description
After Creating and Copping Blob Data call this method to release Blob memory

```pascal
FUNCTION PDF_DestroyBlob(ioBlobPtr : PROCEDURE) : BOOLEAN;
```

```python

def vs.PDF_DestroyBlob(ioBlobPtr):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ioBlobPtr|PROCEDURE||

## Version
Availability: from Vectorworks 2014
## Category
* PDF